// Імпортуємо React, хук useId (для генерування унікальних ідентифікаторів) та useState (якщо потрібен для стану, хоча в даному коді він не використовується).
import React, { useId, useState } from "react";

// Компонент для вводу імені користувача.
const CustomerInput = ({ inputId }) => {
    // Використовуємо хук useId для генерування унікального id для кожного елемента (input). Це корисно для унікальної ідентифікації елементів у DOM.
    const id = useId(); // Генерація унікального id для цього input елемента.

    return (
        // Див для контейнера всіх елементів форми з деякими стилями (відступи, вирівнювання елементів).
        <div style={ { display: "flex", gap: "10px", alignItems: "center", margin: "10px" }}>
            {/* Тег label, що описує поле вводу. Для зв'язку з input використовуємо атрибут htmlFor, що пов'язує його з id поля вводу */}
            <label htmlFor={id}>Customer Name:</label>
            
            {/* Поле вводу (input) для імені користувача. Атрибут id відповідає за унікальну ідентифікацію цього елемента */}
            <input
                type="text" // Тип поля вводу - текст.
                id={id}     // Унікальний id, згенерований хук useId.
            />
        </div>
    );
};

// Експортуємо компонент, щоб його можна було використовувати в інших частинах програми.
export default CustomerInput;
