const List = ({ data, title }) => {  // Оголошуємо компонент List, який приймає два пропси: 'data' - масив елементів, і 'title' - заголовок списку.
    return (
        <div>  {/* Контейнер для всього компоненту */}
            <h2>{title}</h2>  {/* Виводимо заголовок списку, що передається через пропс 'title' */}
            <ul>  {/* Початок списку (ul) */}
                {data.map(item => (  {/* Перебираємо масив 'data' і для кожного елемента створюємо список (li) */}
                    <li key={item.id}>  {/* Використовуємо унікальний 'id' для кожного елемента списку (для оптимізації рендерингу) */}
                        {item.title}  {/* Виводимо назву елемента списку */}
                        <button>delete</button>  {/* Кнопка для видалення елемента зі списку (поки без функціоналу) */}
                    </li>
                ))}
            </ul>  {/* Кінець списку */}
        </div>
    );
}

export default List;  // Експортуємо компонент List для використання в інших частинах програми.
