const Footer = () => {  // Оголошуємо функціональний компонент Footer.
    return (  // Повертаємо JSX розмітку для компонента.
        <footer>  {/* Використовуємо тег <footer> для семантичного позначення футера (нижньої частини сторінки). */}
            <h2>Footer</h2>  {/* Заголовок, що вказує на розділ футера. */}
            <span> &copy; All right reserved! 2024</span>  
            {/* Текст, що містить символ авторського права (&copy;), повідомлення про захист авторських прав і рік. */}
        </footer>
    );
};

export default Footer;  // Експортуємо компонент Footer, щоб його можна було використовувати в інших частинах програми.
