// Імпортуємо React з бібліотеки, що дозволяє використовувати JSX і створювати компоненти.
import React from 'react';

// Оголошуємо компонент NotFound, який буде відображатися, коли сторінка не знайдена (наприклад, при помилці 404).
const NotFound = () => {
  // JSX код, який повертається з компонента.
  return (
    <div>   {/* Тег <div> обгортає наш вивід на сторінці. */}
        <h2>Oops...</h2>   {/* Відображаємо текст "Oops..." як заголовок другого рівня (h2). */}
    </div>
  );
}

// Експортуємо компонент, щоб він міг бути використаний в інших частинах нашого додатку.
export default NotFound;
